app/controllers/articles_controller.rb

SELECT * FROM "articles"
---
  def index
    @articles = Article.all

SELECT * FROM "articles" WHERE ("articles"."id" = 1)
SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def show
    @article = Article.find(params[:id])
    @article_author = User.find(@article.user_id)

SELECT * FROM "articles" WHERE ("articles"."id" = 1)
---
  def edit
    @article = Article.find(params[:id])

INSERT INTO "articles" ("updated_at", "body", "title", "user_id", "created_at") VALUES('2009-08-13 18:01:59', 'The Pavane in F-sharp minor, op. 50, is a composition for orchestra and optional chorus by the French composer Gabriel Fauré and dates from 1887. Obtaining its rhythm from the slow processional Spanish court dance of the same name, the Pavane ebbs and flows from a series of harmonic and melodic climaxes, conjuring a cool, somewhat haunting, Belle Époque elegance. The piece is scored for only modest orchestral forces consisting of strings and one pair each of flutes, oboes, clarinets, bassoons, and horns. A typical performance lasts around seven minutes.', 'Faure pavane', 2, '2009-08-13 18:01:59')
---
  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save

SELECT * FROM "articles" WHERE ("articles"."id" = 2)
UPDATE "articles" SET "body" = '“The problem is the tall buildings,” Mr. Byrnes said, saying the structures block radar signals so air traffic controllers cannot see the aircraft to keep them separated. “These airplanes are at 400 or 500 feet, and the buildings are getting in the way.”
---
  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])

SELECT * FROM "articles" WHERE ("articles"."id" = 1)
DELETE FROM "articles" WHERE "id" = 1
---
  def destroy
    @article = Article.find(params[:id])
    @article.destroy