app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create!(params[:comment])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)
INSERT INTO "comments" ("updated_at", "body", "username", "article_id", "created_at") VALUES('2009-08-13 05:23:15', 'new with username', 'srenaker', 2, '2009-08-13 05:23:15')