app/controllers/links_controller.rb

  def index
    @links = Link.all
---
SELECT * FROM "links"

  def show
    @link = Link.find(params[:id])
---
SELECT * FROM "links" WHERE ("links"."id" = 0)

  def create
    @link = Link.new(params[:link])

    respond_to do |format|
      if @link.save
---
INSERT INTO "links" ("name", "updated_at", "url", "created_at") VALUES('Wonkette', '2009-08-14 04:14:43', 'http://www.wonkette.com', '2009-08-14 04:14:43')