app/controllers/tags_controller.rb

SELECT * FROM "articles" WHERE ("articles"."id" = 4)
INSERT INTO "tags" ("updated_at", "tag", "article_id", "created_at") VALUES('2009-08-14 05:06:23', 'Maryland', 4, '2009-08-14 05:06:23')
---
  def create
    @article = Article.find(params[:article_id])
    @tag = @article.tags.create!(params[:tag])

SELECT * FROM "tags" WHERE ("tags"."id" = 1)
---
  def show
    @tag = Tag.find(params[:id])