app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT * FROM "users"

  def edit
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("updated_at", "username", "first_name", "password", "last_name", "email", "created_at", "use_gravatar") VALUES('2009-08-15 04:28:09', 'owilde', 'Oscar', 'abc', 'Wil', 'owilde@gmail.com', '2009-08-15 04:28:09', '1')