app/controllers/visits_controller.rb

SELECT * FROM "users" WHERE (username = 'srenaker' and password = 'oakwood') LIMIT 1
---
  def form_login
    @username = params[:username]
    @password = params[:password]

    @login_result = User.find(:first, :conditions => "username = '#{@username}' and password = '#{@password}'")